particle-iot/device-os/hal/src/nRF52840/core_hal.c
    return valid;
}
#endif

bool HAL_Core_Mode_Button_Pressed(uint16_t pressedMillisDuration) {
    bool pressedState = false;

    if(BUTTON_GetDebouncedTime(BUTTON1) >= pressedMillisDuration) {
        pressedState = true;
    }
    if(BUTTON_GetDebouncedTime(BUTTON1_MIRROR) >= pressedMillisDuration) {
        pressedState = true;
    }

    return pressedState;
}

void HAL_Core_Mode_Button_Reset(uint16_t button)
{
}

void HAL_Core_System_Reset(void) {
    NVIC_SystemReset();
}

void HAL_Core_System_Reset_Ex(int reason, uint32_t data, void *reserved) {
    if (HAL_Feature_Get(FEATURE_RESET_INFO)) {
        // Save reset info to backup registers
        HAL_Core_Write_Backup_Register(BKP_DR_02, reason);
        HAL_Core_Write_Backup_Register(BKP_DR_03, data);
    }

    HAL_Core_System_Reset();
}

void HAL_Core_Factory_Reset(void) {
    system_flags.Factory_Reset_SysFlag = 0xAAAA;
    Save_SystemFlags();
    HAL_Core_System_Reset_Ex(RESET_REASON_FACTORY_RESET, 0, NULL);
}

void HAL_Core_Enter_Safe_Mode(void* reserved) {
    HAL_Core_Write_Backup_Register(BKP_DR_01, ENTER_SAFE_MODE_APP_REQUEST);
    HAL_Core_System_Reset_Ex(RESET_REASON_SAFE_MODE, 0, NULL);
}

bool HAL_Core_Enter_Safe_Mode_Requested(void)
{
    Load_SystemFlags();
    uint8_t flags = SYSTEM_FLAG(StartupMode_SysFlag);

    return (flags & 1);
}

void HAL_Core_Enter_Bootloader(bool persist) {
    if (persist) {
        HAL_Core_Write_Backup_Register(BKP_DR_10, 0xFFFF);
        system_flags.FLASH_OTA_Update_SysFlag = 0xFFFF;
        Save_SystemFlags();
    } else {
        HAL_Core_Write_Backup_Register(BKP_DR_01, ENTER_DFU_APP_REQUEST);
    }

    HAL_Core_System_Reset_Ex(RESET_REASON_DFU_MODE, 0, NULL);
}

static void fpu_sleep_prepare(void) {
    uint32_t fpscr;
    CRITICAL_REGION_ENTER();
    fpscr = __get_FPSCR();
    /*
        * Clear FPU exceptions.
        * Without this step, the FPU interrupt is marked as pending,
        * preventing system from sleeping. Exceptions cleared:
        * - IOC - Invalid Operation cumulative exception bit.
        * - DZC - Division by Zero cumulative exception bit.
        * - OFC - Overflow cumulative exception bit.
        * - UFC - Underflow cumulative exception bit.
        * - IXC - Inexact cumulative exception bit.
        * - IDC - Input Denormal cumulative exception bit.
        */
    __set_FPSCR(fpscr & ~0x9Fu);
    __DMB();
    NVIC_ClearPendingIRQ(FPU_IRQn);
    CRITICAL_REGION_EXIT();

    /*__
        * Assert no critical FPU exception is signaled:
        * - IOC - Invalid Operation cumulative exception bit.
        * - DZC - Division by Zero cumulative exception bit.
        * - OFC - Overflow cumulative exception bit.
        */
    SPARK_ASSERT((fpscr & 0x07) == 0);
}
void HAL_Core_Enter_Stop_Mode(uint16_t wakeUpPin, uint16_t edgeTriggerMode, long seconds) {
    InterruptMode m = (InterruptMode)edgeTriggerMode;
    HAL_Core_Enter_Stop_Mode_Ext(&wakeUpPin, 1, &m, 1, seconds, NULL);
}

static void wakeup_rtc_handler(nrfx_rtc_int_type_t int_type) {
    wakeup_info.source |= STOP_MODE_EXIT_CONDITION_RTC;
}

static void wakeup_gpiote_handler(void* data) {
    wakeup_info.source |= STOP_MODE_EXIT_CONDITION_PIN;
    wakeup_info.pin_index = (uint32_t)data;
}

static void wakeup_from_rtc(uint32_t seconds) {
    //Initialize RTC instance
    nrfx_rtc_config_t config = {
        .prescaler          = 0xFFF, // 125 ms counter period, 582.542 hours overflow
        .interrupt_priority = RTC_IRQ_Priority,
        .tick_latency       = 0,
        .reliable           = false
    };

    uint32_t err_code = nrfx_rtc_init(&m_rtc, &config, wakeup_rtc_handler);
    SPARK_ASSERT(err_code == NRF_SUCCESS);

    // Set compare channel to trigger interrupt after COMPARE_COUNTERTIME seconds
    nrfx_rtc_counter_clear(&m_rtc);
    err_code = nrfx_rtc_cc_set(&m_rtc, 0, seconds * 8, true);
    SPARK_ASSERT(err_code == NRF_SUCCESS);

    // Power on RTC instance
    nrfx_rtc_enable(&m_rtc);
}

int32_t HAL_Core_Enter_Stop_Mode_Ext(const uint16_t* pins, size_t pins_count, const InterruptMode* mode, size_t mode_count, long seconds, void* reserved) {
    // Initial sanity check
    if ((pins_count == 0 || mode_count == 0 || pins == NULL || mode == NULL) && seconds <= 0) {
        return SYSTEM_ERROR_NOT_ALLOWED;
    }

    // Validate pins and modes
    if ((pins_count > 0 && pins == NULL) || (pins_count > 0 && mode_count == 0) || (mode_count > 0 && mode == NULL)) {
        return SYSTEM_ERROR_NOT_ALLOWED;
    }

    for (unsigned i = 0; i < pins_count; i++) {
        if (pins[i] >= TOTAL_PINS) {
            return SYSTEM_ERROR_NOT_ALLOWED;
        }
    }

    for (int i = 0; i < mode_count; i++) {
        switch(mode[i]) {
            case RISING:
            case FALLING:
            case CHANGE:
                break;
            default:
                return SYSTEM_ERROR_NOT_ALLOWED;
        }
    }

    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;

    // Detach USB
    HAL_USB_Detach();

    // Disable RTC2
    nrf5AlarmDeinit();

    // Disable external flash
    hal_exflash_uninit();

    // Flush all USARTs
    for (int usart = 0; usart < TOTAL_USARTS; usart++) {
        if (HAL_USART_Is_Enabled(usart)) {
            HAL_USART_Flush_Data(usart);
        }
    }

    // Disable all interrupt, __disable_irq()
    uint8_t dummy = 0;
    uint32_t err_code = sd_nvic_critical_region_enter(&dummy);
    SPARK_ASSERT(err_code == NRF_SUCCESS);

    wakeup_info.source = STOP_MODE_EXIT_CONDITION_NONE;

    bool hfclk_resume = false;
    if (nrf_drv_clock_hfclk_is_running()) {
        hfclk_resume = true;
        nrf_drv_clock_hfclk_release();
        while (nrf_drv_clock_hfclk_is_running()) {
            ;
        }
    }

    uint32_t exit_conditions = 0x00;

    // Suspend all GPIOTE interrupts
    HAL_Interrupts_Suspend();

    for (int i = 0; i < pins_count; i++) {
        pin_t wakeUpPin = pins[i];
        InterruptMode edgeTriggerMode = (i < mode_count) ? mode[i] : mode[mode_count - 1];

        PinMode wakeUpPinMode = INPUT;
        // Set required pinMode based on edgeTriggerMode
        switch(edgeTriggerMode) {
            case RISING: {
                wakeUpPinMode = INPUT_PULLDOWN;
                break;
            }
            case FALLING: {
                wakeUpPinMode = INPUT_PULLUP;
                break;
            }
            case CHANGE:
            default:
                wakeUpPinMode = INPUT;
                break;
        }

        HAL_Pin_Mode(wakeUpPin, wakeUpPinMode);
        HAL_InterruptExtraConfiguration irqConf = {0};
        irqConf.version = HAL_INTERRUPT_EXTRA_CONFIGURATION_VERSION_2;
        irqConf.IRQChannelPreemptionPriority = 0;
        irqConf.IRQChannelSubPriority = 0;
        irqConf.keepHandler = 1;
        irqConf.keepPriority = 1;
        HAL_Interrupts_Attach(wakeUpPin, wakeup_gpiote_handler, (void*)(uint32_t)i, edgeTriggerMode, &irqConf);

        exit_conditions |= STOP_MODE_EXIT_CONDITION_PIN;
    }

    // Configure RTC wake-up
    if (seconds > 0) {
        wakeup_from_rtc(seconds);

