particle-iot/device-os/hal/src/nRF52840/core_hal.c
        exit_conditions |= STOP_MODE_EXIT_CONDITION_RTC;
    }

    // Enable all interrupt, __enable_irq()
    err_code = sd_nvic_critical_region_exit(dummy);
    APP_ERROR_CHECK(err_code);

    fpu_sleep_prepare();

    // Enter sleep mode, wait for event
    do {
        SPARK_ASSERT(sd_app_evt_wait() == NRF_SUCCESS);
    } while (wakeup_info.source == STOP_MODE_EXIT_CONDITION_NONE);

    int32_t reason = SYSTEM_ERROR_NOT_SUPPORTED;

    if (exit_conditions & STOP_MODE_EXIT_CONDITION_PIN) {
        if (wakeup_info.source & STOP_MODE_EXIT_CONDITION_PIN) {
            reason = wakeup_info.pin_index + 1;
        }
        for (int i = 0; i < pins_count; i++) {
            pin_t wakeUpPin = pins[i];
            /* Detach the Interrupt pin */
            HAL_Interrupts_Detach_Ext(wakeUpPin, 1, NULL);
        }
    }

    if (exit_conditions & STOP_MODE_EXIT_CONDITION_RTC) {
        if (wakeup_info.source & STOP_MODE_EXIT_CONDITION_RTC) {
            reason = 0;
        }
    }

    // Restore wakeup RTC
    nrfx_rtc_uninit(&m_rtc);

    // Restore GPIOTE
    HAL_Interrupts_Restore();

    // Restore hfclk
    if (hfclk_resume) {
        nrf_drv_clock_hfclk_request(NULL);
        while (!nrf_drv_clock_hfclk_is_running()) {
            ;
        }
    }

    hal_exflash_init();

    nrf5AlarmInit();

    HAL_USB_Attach();

    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;

    return reason;
}

void HAL_Core_Execute_Stop_Mode(void) {
}

int HAL_Core_Enter_Standby_Mode(uint32_t seconds, uint32_t flags) {
    // RTC cannot be kept running in System OFF mode, so wake up by RTC
    // is not supported in deep sleep
    if (seconds > 0) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

    return HAL_Core_Execute_Standby_Mode_Ext(flags, NULL);
}

int HAL_Core_Execute_Standby_Mode_Ext(uint32_t flags, void* reserved) {
    // Force to use external wakeup pin on Gen 3 Device
    if (flags & HAL_STANDBY_MODE_FLAG_DISABLE_WKP_PIN) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

    // Uninit GPIOTE
    nrfx_gpiote_uninit();

    // Disable GPIOTE PORT interrupts
    nrf_gpiote_int_disable(GPIOTE_INTENSET_PORT_Msk);

    // Clear any GPIOTE events
    nrf_gpiote_event_clear(NRF_GPIOTE_EVENTS_PORT);

    // Disable low power comparator
    nrf_lpcomp_disable();

    // Configure wakeup pin
    NRF5x_Pin_Info* PIN_MAP = HAL_Pin_Map();
    uint32_t nrf_pin = NRF_GPIO_PIN_MAP(PIN_MAP[WKP].gpio_port, PIN_MAP[WKP].gpio_pin);
    nrf_gpio_cfg_sense_input(nrf_pin, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_SENSE_LOW);

    // RAM retention is configured on early boot in Set_System()

    SPARK_ASSERT(sd_power_system_off() == NRF_SUCCESS);
    while (1);
    return 0;
}

void HAL_Core_Execute_Standby_Mode(void) {
}

bool HAL_Core_System_Reset_FlagSet(RESET_TypeDef resetType) {
    uint32_t reset_reason = SYSTEM_FLAG(RCC_CSR_SysFlag);
    if (reset_reason == 0xffffffff) {
        sd_power_reset_reason_get(&reset_reason);
    }
    switch(resetType) {
        case PIN_RESET: {
            return reset_reason == NRF_POWER_RESETREAS_RESETPIN_MASK;
        }
        case SOFTWARE_RESET: {
            return reset_reason == NRF_POWER_RESETREAS_SREQ_MASK;
        }
        case WATCHDOG_RESET: {
            return reset_reason == NRF_POWER_RESETREAS_DOG_MASK;
        }
        case POWER_MANAGEMENT_RESET: {
            // SYSTEM OFF Mode
            return reset_reason == NRF_POWER_RESETREAS_OFF_MASK;
        }
        // If none of the reset sources are flagged, this indicates that
        // the chip was reset from the on-chip reset generator,
        // which will indicate a power-on-reset or a brownout reset.
        case POWER_DOWN_RESET:
        case POWER_BROWNOUT_RESET: {
            return reset_reason == 0;
        }
        default:
            return false;
    }
}

static void Init_Last_Reset_Info()
{
    if (HAL_Core_System_Reset_FlagSet(SOFTWARE_RESET))
    {
        // Load reset info from backup registers
        last_reset_info.reason = HAL_Core_Read_Backup_Register(BKP_DR_02);
        last_reset_info.data = HAL_Core_Read_Backup_Register(BKP_DR_03);
        // Clear backup registers
        HAL_Core_Write_Backup_Register(BKP_DR_02, 0);
        HAL_Core_Write_Backup_Register(BKP_DR_03, 0);
    }
    else // Hardware reset
    {
        if (HAL_Core_System_Reset_FlagSet(WATCHDOG_RESET))
        {
            last_reset_info.reason = RESET_REASON_WATCHDOG;
        }
        else if (HAL_Core_System_Reset_FlagSet(POWER_MANAGEMENT_RESET))
        {
            last_reset_info.reason = RESET_REASON_POWER_MANAGEMENT; // Reset generated when entering standby mode (nRST_STDBY: 0)
        }
        else if (HAL_Core_System_Reset_FlagSet(POWER_DOWN_RESET))
        {
            last_reset_info.reason = RESET_REASON_POWER_DOWN;
        }
        else if (HAL_Core_System_Reset_FlagSet(POWER_BROWNOUT_RESET))
        {
            last_reset_info.reason = RESET_REASON_POWER_BROWNOUT;
        }
        else if (HAL_Core_System_Reset_FlagSet(PIN_RESET)) // Pin reset flag should be checked in the last place
        {
            last_reset_info.reason = RESET_REASON_PIN_RESET;
        }
        // TODO: Reset from USB, NFC, LPCOMP...
        else
        {
            last_reset_info.reason = RESET_REASON_UNKNOWN;
        }
        last_reset_info.data = 0; // Not used
    }

    // Clear Reset info register
    sd_power_reset_reason_clr(0xFFFFFFFF);
}

int HAL_Core_Get_Last_Reset_Info(int *reason, uint32_t *data, void *reserved) {
    if (HAL_Feature_Get(FEATURE_RESET_INFO)) {
        if (reason) {
            *reason = last_reset_info.reason;
        }
        if (data) {
            *data = last_reset_info.data;
        }
        return 0;
    }
    return -1;
}

/**
 * @brief  Computes the 32-bit CRC of a given buffer of byte data.
 * @param  pBuffer: pointer to the buffer containing the data to be computed
 * @param  BufferSize: Size of the buffer to be computed
 * @retval 32-bit CRC
 */
uint32_t HAL_Core_Compute_CRC32(const uint8_t *pBuffer, uint32_t bufferSize) {
    // TODO: Use the peripheral lock?
    return Compute_CRC32(pBuffer, bufferSize, NULL);
}

uint16_t HAL_Core_Mode_Button_Pressed_Time() {
    return 0;
}

void HAL_Bootloader_Lock(bool lock) {

